retsimx/tlsr8266_mesh/src/main_light.c
/********************************************************************************************************
 * @file     main_light.c 
 *
 * @brief    for TLSR chips
 *
 * @author	 telink
 *
 * @par      Copyright (c) Telink Semiconductor (Shanghai) Co., Ltd.
 *           All rights reserved.
 *           
 *			 The information contained herein is confidential and proprietary property of Telink 
 * 		     Semiconductor (Shanghai) Co., Ltd. and is available under the terms 
 *			 of Commercial License Agreement between Telink Semiconductor (Shanghai) 
 *			 Co., Ltd. and the licensee in separate contract or the terms described here-in. 
 *           This heading MUST NOT be removed from this file.
 *
 * 			 Licensees are granted free, non-transferable use of the information in this 
 *			 file under Mutual Non-Disclosure Agreement. NO WARRENTY of ANY KIND is provided. 
 *           
 *******************************************************************************************************/
#include "proj/tl_common.h"
#include "proj/mcu/watchdog_i.h"
#include "proj_lib/rf_drv.h"
#include "proj_lib/pm.h"
#include "proj_lib/light_ll/light_ll.h"
#include "proj_lib/light_ll/light_frame.h"
#include "proj_lib/ble_ll/service.h"
#include "vendor/common/rtc.h"
#include "proj/drivers/flash.h"
#include "vendor/common/common.h"
#include "proj_lib/ble_ll/blueLight.h"

#define LED_INDICATE_VAL    (0xff)

#define LIGHT_ADJUST_STEP_EN    1
#define LIGHT_NOTIFY_MESH_EN    0
#define SW_GET_MESH_DATA		0		//exchange data with switch(use mesh)

FLASH_ADDRESS_EXTERN;

u16 		ota_pkt_cnt = 0;
u32 		lum_changed_time = 0;
u32 		active_time = 0;
int			led_dbg;
u32			buff_response[48][9];
u8 			write_master_data = 0;
u32 		light_lum_addr = 0;
u16			led_val[3] = {MAX_LUM_BRIGHTNESS_VALUE, MAX_LUM_BRIGHTNESS_VALUE, MAX_LUM_BRIGHTNESS_VALUE};
u16         led_lum = 0xffff;
u32			led_event_pending;
u16			cmd_delay_ms = 0;
u16			cmd_left_delay_ms = 0;
u32 		irq_timer1_cb_time = 0;
u32         slave_send_data = 0;
u8 			light_off = 1;
ll_packet_l2cap_data_t cmd_delay;

fp_rf_led_ota_ok 			p_vendor_rf_led_ota_ok 			= 0;
fp_rf_led_ota_error			p_vendor_rf_led_ota_error 		= 0;
fp_irq_timer1 				p_vendor_irq_timer1 			= 0;
fp_proc_led 				p_vendor_proc_led 				= 0;
fp_rf_link_data_callback	p_vendor_rf_link_data_callback	= 0;
fp_user_init 				p_vendor_user_init				= 0;

#define		reg_debug_cmd		REG_ADDR16(0x800c)
#define 	PANEL_LED		    GPIO_PA5

// send_to_master 16bytes data, will be reset after send to master
extern u8 	send_to_master[];

extern u8 	max_mesh_name_len;
extern u8* 	slave_p_mac;
extern u16 	slave_group;
extern u32	slave_first_connected_tick;
extern u8 	pair_login_ok;
extern u8   not_need_login;
extern u8 	slave_link_connected;
extern u8	rf_link_key[];
extern u8 	max_relay_num;
extern ll_adv_private_t adv_pri_data;
extern ll_adv_rsp_private_t adv_rsp_pri_data;
extern u8	adv_private_data_len;
extern u8 security_enable;

////////////////////////////////////////////////////////////////////////////
rf_custom_dat_t slave_tx_cmd = {
		0x0, 0x0,					//nid,ttc
		0xffff,						//group
		0xffffffff,					//destination id
		{0x12, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},
	};
	
rf_custom1_dat_t slave_tx_cmd1 = {
	{0, 0, 0},
	{0x11, 0x11}
	};

//////////////////////////////////////////////////////
#define LED_MASK							0x07
#define	config_led_event(on,off,n,sel)		(on | (off<<8) | (n<<16) | (sel<<24))

#define	LED_EVENT_FLASH_4HZ_10S				config_led_event(2,2,40,LED_MASK)
#define	LED_EVENT_FLASH_STOP				config_led_event(1,1,1,LED_MASK)
#define	LED_EVENT_FLASH_2HZ_2S				config_led_event(4,4,4,LED_MASK)
#define	LED_EVENT_FLASH_1HZ_1S				config_led_event(8,8,1,LED_MASK)
#define	LED_EVENT_FLASH_1HZ_2S				config_led_event(8,8,2,LED_MASK)
#define	LED_EVENT_FLASH_1HZ_3S				config_led_event(8,8,3,LED_MASK)
#define	LED_EVENT_FLASH_1HZ_4S				config_led_event(8,8,4,LED_MASK)
#define	LED_EVENT_FLASH_4HZ					config_led_event(2,2,0,LED_MASK)
#define	LED_EVENT_FLASH_1HZ					config_led_event(8,8,0,LED_MASK)
#define	LED_EVENT_FLASH_4HZ_3T				config_led_event(2,2,3,LED_MASK)
#define	LED_EVENT_FLASH_1HZ_3T				config_led_event(8,8,3,LED_MASK)
#define	LED_EVENT_FLASH_0p25HZ_1T			config_led_event(4,60,1,LED_MASK)

extern void light_set_tick_per_us(int tick);
extern void	rf_link_slave_pairing_enable(int en);
extern void	rf_link_slave_set_buffer (u32 *p, u8 n);
extern int rf_link_get_op_para(u8 *p, u8 *op, u8 *op_len, u8 *para, u8 *para_len, u8 mesh_flag);

float calculate_lumen_map(u16 val) {
    float percentage = ((float) val / (float) MAX_LUM_BRIGHTNESS_VALUE) * 100.f;
    float x2 = percentage * percentage;
    float x3 = x2 * percentage;
    return (-0.00539160*x3)+(4.47709595*x2)+(153.72442036*percentage);
}

void	pwm_set_lum (int id, u32 y, int pol)
{
    u32 lum = ((u32)y * PMW_MAX_TICK) / MAX_LUM_BRIGHTNESS_VALUE;

	pwm_set_cmp (id, pol ? PMW_MAX_TICK - lum : lum);
}

u32 get_pwm_cmp(u16 val, u16 lum){
    float val_lumen_map = calculate_lumen_map(lum);
    
//#if LIGHT_ADJUST_STEP_EN
//    light_step_correct_mod(&val_lumen_map, lum);
//#endif

    float val_temp = val;
    return (val_temp * val_lumen_map) / MAX_LUM_BRIGHTNESS_VALUE;
}

void light_adjust_R(u16 val, u16 lum){
    pwm_set_lum (PWMID_R, get_pwm_cmp(val, lum), 0);
}

void light_adjust_G(u16 val, u16 lum){
    pwm_set_lum (PWMID_G, get_pwm_cmp(val, lum), 0);
}

void light_adjust_B(u16 val, u16 lum){
    pwm_set_lum (PWMID_B, get_pwm_cmp(val, lum), 1);
}

void light_adjust_RGB_hw(u16 val_R, u16 val_G, u16 val_B, u16 lum){
	light_adjust_R(val_R, lum);
	light_adjust_G(val_G, lum);
	light_adjust_B(val_B, lum);
}

extern void light_step_reset(u16 target);

void light_onoff_normal(u8 on){
    if(on){
        light_off = 0;
    	light_adjust_RGB_hw(led_val[0], led_val[1], led_val[2], led_lum);
	}else{
        light_off = 1;
    	light_adjust_RGB_hw(0, 0, 0, 0);
	}
}

void device_status_update(){
    // packet
    u8 st_val_par[MESH_NODE_ST_PAR_LEN] = {0};
    memset(st_val_par, 0xFF, sizeof(st_val_par));

