retsimx/tlsr8266_mesh/src/main_light.c
typedef struct{
    u8 save_falg;
    u16 lum;
    u16 ledval[3];
}lum_save_t;

extern void light_lum_erase(void);
//retrieve LUM : brightness or RGB/CT value
void light_lum_retrieve(void){
    for(int i = 0; i < (FLASH_SECTOR_SIZE); i += sizeof(lum_save_t)){
		light_lum_addr = flash_adr_lum + i;
	
        lum_save_t *lum_save = (lum_save_t *)(light_lum_addr);
		if(LUM_SAVE_FLAG == lum_save->save_falg){
            led_lum = lum_save->lum;
            memcpy(led_val, lum_save->ledval, sizeof(led_val));
		}else if(lum_save->save_falg != 0xFF){
		    //invalid
		    continue;
		}else{
		    break;
		}
	}

	//effect
    #if LIGHT_ADJUST_STEP_EN
	light_adjust_RGB_hw(0, 0, 0, 0);
	#endif

	mesh_ota_master_100_flag_check();
	
	u8 val = analog_read(rega_light_off);
	if(val & FLD_LIGHT_OFF){
	    analog_write(rega_light_off, val & (~ FLD_LIGHT_OFF));
	    light_onoff(0);
	}else{
	    light_onoff(1);
	}
}

//save cur lum value, if disconnected for a while
u8 light_lum_store(void){
	if(light_lum_addr >= (flash_adr_lum + FLASH_SECTOR_SIZE - sizeof(lum_save_t))){
		light_lum_erase();
		return 1;
	}
	
    lum_save_t lum_save = {0};
	
    lum_save.save_falg = LUM_SAVE_FLAG;
    lum_save.lum = led_lum;
    memcpy(lum_save.ledval, led_val, sizeof(lum_save.ledval));
	
	flash_write_page(light_lum_addr, sizeof(lum_save), (u8 *)(&lum_save));
	light_lum_addr += sizeof(lum_save_t);
	
	return 1;
}

//erase flash
void light_lum_erase(void){
	light_lum_addr = flash_adr_lum;
	flash_erase_sector(flash_adr_lum);
	light_lum_store();
}

#if 1
/*@brief: This function is called in IRQ state, use IRQ stack.
*/
char lightOn = 0;
void rf_link_data_callback (u8 *p)
{
    // p start from l2capLen of rf_packet_att_cmd_t
	if(p_vendor_rf_link_data_callback){
		p_vendor_rf_link_data_callback(p);
		return;
	}
	u8 op = 0;
    u8 op_cmd[8] = {0};
    u8 op_cmd_len = 0;
    u8 params[16] = {0};
    u8 params_len = 0;
    rf_packet_att_value_t *pp = (rf_packet_att_value_t*)(((ll_packet_l2cap_data_t*)(p))->value);
    rf_link_get_op_para(p, op_cmd, &op_cmd_len, params, &params_len, 1);

    if(op_cmd_len == op_type_1){
    }else if(op_cmd_len == op_type_2){
    }else if(op_cmd_len == op_type_3){
        u16 vendor_id = op_cmd[2] << 8 | op_cmd[1];
        op = op_cmd[0] & 0x3F;

        	if(op == LGT_CMD_LIGHT_ONOFF){
        		if(cmd_left_delay_ms){
        			return;
        		}
        		cmd_delay_ms = params[1] | (params[2] << 8);
        		if(cmd_delay_ms && !irq_timer1_cb_time){
        			u16 cmd_delayed_ms = light_cmd_delayed_ms(pp->val[op_cmd_len+params_len]);
        			if(cmd_delay_ms > cmd_delayed_ms){
        				memcpy(&cmd_delay, p, sizeof(ll_packet_l2cap_data_t));
        				cmd_left_delay_ms = cmd_delay_ms - cmd_delayed_ms;
        				irq_timer1_cb_time = clock_time();
        				return;
        			}
        		}
        	}
        	
            mesh_ota_timeout_handle(op, params);

            if(op == LGT_CMD_LIGHT_ONOFF){
                if(params[0] == LIGHT_ON_PARAM){
					#if SUB_ADDR_EN
            		light_multy_onoff(pp->dst, 1);
            		#else
            		light_onoff(1);
            		#endif
        		}else if(params[0] == LIGHT_OFF_PARAM){
        		    if(ON_OFF_FROM_OTA == params[3]){ // only PWM off, 
                        light_step_reset(0);
        		    }else{
        		        #if SUB_ADDR_EN
        		        light_multy_onoff(pp->dst, 0);
        		        #else
            		    light_onoff(0);
            		    #endif
            		}
        		}else if(params[0] == LIGHT_SYNC_REST_PARAM){
                    #if (SYNC_TIME_EN)
                    sync_time_reset();
            		#endif
        		}
            }
#if (SYNC_TIME_EN)
            else if(op == LGT_CMD_TIME_SYNC){    // don't modify, internal use
                u16 cmd_delayed_ms = light_cmd_delayed_ms(pp->val[op_cmd_len+params_len]);
                if(sync_time_callback(params, cmd_delayed_ms, IRQ_TIME1_INTERVAL, p)){
                    return ;
                }
            }
#endif        	
            else if (op == LGT_CMD_LIGHT_CONFIG_GRP){
        		u16 val = (params[1] | (params[2] << 8));
        		if(params[0] == LIGHT_DEL_GRP_PARAM){
        			extern u8 rf_link_del_group(u16 group);
        			if(rf_link_del_group(val)){
        			    cfg_led_event(LED_EVENT_FLASH_1HZ_4S);
        			}
        		}else if(params[0] == LIGHT_ADD_GRP_PARAM){
        			extern u8 rf_link_add_group(u16 group);
        			if(rf_link_add_group(val)){
        			    cfg_led_event(LED_EVENT_FLASH_1HZ_4S);
        			}
        		}
        	}else if (op == LGT_CMD_CONFIG_DEV_ADDR){
        		u16 val = (params[0] | (params[1] << 8));
    			extern u8 rf_link_add_dev_addr(u16 deviceaddress);
    			if(!dev_addr_with_mac_flag(params) || dev_addr_with_mac_match(params)){
    				if(rf_link_add_dev_addr(val)){
						mesh_pair_proc_get_mac_flag();
					}
    			}
        	}
            else if (op == LGT_CMD_SET_LIGHT)
        	{
                if (params[8] & 0x1) {
                    // Brightness
                    u16 value = ((u16) params[1] << 8) | (u8) params[0];
                    if(light_off){
                        led_lum = value;
                        return;
                    }
                    light_step_reset(value);
                }
                if (params[8] & 0x2) {
                    // Temperature
                    u16 value = ((u16) params[3] << 8) | (u8) params[2];

                    led_val[0] = 0;
                    led_val[1] = MAX_LUM_BRIGHTNESS_VALUE - value;
                    led_val[2] = value;

                    if(light_off){
                        return;
                    }

                    light_step_reset(led_lum);
                }

                lum_changed_time = clock_time();
        	}
        	else if (op == LGT_CMD_KICK_OUT)
        	{
        		if(is_mesh_cmd_need_delay(p, params, pp->val[op_cmd_len+params_len])){
        			return ;
        		}
        	    irq_disable();
        	    void kick_out(u8 par);
        	    kick_out(params[0]);
        	    light_sw_reboot();
        	}
            else if (op == LGT_CMD_NOTIFY_MESH)
            {
                light_notify(pp->val+3, 10, pp->src);
            }
            else if (op == LGT_CMD_MESH_OTA_DATA)
            {
                u16 idx = params[0] + (params[1] << 8);
                if(!is_master_ota_st()){  // no update firmware for itself
                    if(CMD_START_MESH_OTA == idx){
                        mesh_ota_master_start_firmware_from_own();
                        //cfg_led_event(LED_EVENT_FLASH_1HZ_4S);
                    }else if(CMD_STOP_MESH_OTA == idx){
                        if(is_mesh_ota_slave_running()){
                            // reboot to initial flash: should be delay to relay command.
                            mesh_ota_slave_reboot_delay();  // reboot after 320ms
                        }
                    }else{
                        if(mesh_ota_slave_save_data(params)){
                            static u16 mesh_ota_error_cnt;
                            mesh_ota_error_cnt++;
                        }
                    }
                }else{
                    if(CMD_STOP_MESH_OTA == idx){
                        mesh_ota_master_cancle(OTA_STATE_MASTER_OTA_REBOOT_ONLY, 0);
                        //cfg_led_event(LED_EVENT_FLASH_4HZ_3T);
                    }
                }
            }
#if(MESH_PAIR_ENABLE)
            else if (op == LGT_CMD_MESH_PAIR)
            {
                mesh_pair_cb(params);
            }
#endif
#if SW_GET_MESH_DATA
		else if(op == LGT_CMD_SW_DATA)
		{
			static u8 cnt;
			if((++cnt)%2)
				light_onoff(0);
			else
				light_onoff(1);
			SWClock = clock_time();
			SWTxCnt = 0;
		}
#endif
    }
}

