retsimx/tlsr8266_mesh/src/main_light.c
/*@brief: This function is called in IRQ state, use IRQ stack.
**@param: p: p is pointer to response
**@param: p_cmd_rx: is pointer to request command*/
int rf_link_response_callback (u8 *p, u8 *p_cmd_rx)
{
    // mac-app[5] low 2 bytes used as ttc && hop-count 
    rf_packet_att_value_t *ppp = (rf_packet_att_value_t*)(p);
    rf_packet_att_value_t *p_req = (rf_packet_att_value_t*)(p_cmd_rx);
    bool dst_unicast = is_unicast_addr(p_req->dst);
	memcpy(ppp->dst, p_req->src, 2);
	memcpy(ppp->src, &device_address, 2);
	set_sub_addr2rsp((device_addr_sub_t *)ppp->src, p_req->dst, dst_unicast);
	//memcpy(ppp->dst, (u8*)&slave_group, 2);
	
#if(ALARM_EN || SCENE_EN)
	#if SUB_ADDR_EN
	device_addr_sub_t *p_adr_sub = (device_addr_sub_t *)ppp->src;
	u8 need_bridge = p_adr_sub->dev_id != get_addr_by_pointer(ppp->dst);
	#else
	u8 need_bridge = (0 != memcmp(ppp->src, ppp->dst, 2));
	#endif
#endif

	u8 params[10] = {0};
	memcpy(params, ppp->val+3, sizeof(params)); // be same with p_req->val+3
	memset(ppp->val+3, 0, 10);
	    
	ppp->val[1] = VENDOR_ID & 0xFF;
	ppp->val[2] = VENDOR_ID >> 8;

	ppp->val[18] = max_relay_num;

    u8 idx = 0;
	if(ppp->val[15] == GET_STATUS){
	    ppp->val[0] = LGT_CMD_LIGHT_STATUS | 0xc0;
	    foreach(i, 3){//params[0]
            ppp->val[i+3] = (light_off)?0:led_val[i];
	    }
	}else if(ppp->val[15] == GET_GROUP1){
	    ppp->val[0] = LGT_CMD_LIGHT_GRP_RSP1 | 0xc0;
	    foreach(i, MAX_GROUP_NUM){
            ppp->val[i+3] = 0xFF;
	        if(group_address[i]){
    	        ppp->val[idx+3] = group_address[i];
    	        ++idx;
    	    }
	    }
	}else if(ppp->val[15] == GET_GROUP2){
	    ppp->val[0] = LGT_CMD_LIGHT_GRP_RSP2 | 0xc0;
	    foreach(i, MAX_GROUP_NUM){
            ppp->val[i+3] = 0xFF;
	        if(group_address[i/2]){
    	        ppp->val[idx+3] = (i%2)?(group_address[i/2]>>8):(group_address[i/2]);
    	        ++idx;
    	    }
	    }
	}else if(ppp->val[15] == GET_GROUP3){
	    ppp->val[0] = LGT_CMD_LIGHT_GRP_RSP3 | 0xc0;
	    foreach(i, MAX_GROUP_NUM){
            ppp->val[i+3] = 0xFF;
	        if(group_address[4+i/2]){
    	        ppp->val[idx+3] = (i%2)?(group_address[4+i/2]>>8):(group_address[4+i/2]);
    	        ++idx;
    	    }
	    }
	}else if(ppp->val[15] == GET_DEV_ADDR){
	    ppp->val[0] = LGT_CMD_DEV_ADDR_RSP | 0xc0;
		if(dev_addr_with_mac_flag(params)){
			return dev_addr_with_mac_rsp(params, ppp->val + 3);
	    }else{
		    memcpy(ppp->val + 3, &device_address, 2);
	    }
	}else if(ppp->val[15] == GET_USER_NOTIFY){
        /*user can get parameters from APP.
             params[0] is relay times.
             params[1 -- 9] is parameters from APP if haved been set by user.
             
             dst_unicast == 1 means destination address is unicast address.
             */
        if(dst_unicast){
        	// params[0 -- 9] is valid
        }else{
        	// only params[0 -- 4] is valid
        }
        
	    ppp->val[0] = LGT_CMD_USER_NOTIFY_RSP | 0xc0;
	    foreach(i, 8){//params[2]
            ppp->val[5+i] = i;
	    }
	    memcpy(ppp->val + 3, &device_address, 2);
	}else if(ppp->val[15] == GET_MESH_OTA){
	    ppp->val[0] = LGT_CMD_MESH_OTA_READ_RSP | 0xc0;
#if(MESH_PAIR_ENABLE)
		if(params[1] == PAR_READ_MESH_PAIR_CONFIRM){
			foreach(i, 8){
				ppp->val[5+i] = get_mesh_pair_checksum(i);
			}
			memcpy(ppp->val + 3, &device_address, 2);
			return 1;
		}
#endif
	    return mesh_ota_slave_set_response(ppp->val+3, params[1]);
	}else{
	    return 0;
	}
	
	return 1;
}

void light_init_default(void){
	extern u8 advData[3];
	#if ADV_UUID
	//extern u8 adv_uuid[4];
	u8 len = sizeof(advData) + (sizeof(ll_adv_private_t) + 2) + sizeof(adv_uuid);
	#else
	u8 len = sizeof(advData) + (sizeof(ll_adv_private_t) + 2);
	#endif
	if(len >= 31){
		// error
		max_mesh_name_len = 0;
	}else{
		max_mesh_name_len = 31 - len - 2;
		max_mesh_name_len = max_mesh_name_len < 16 ? max_mesh_name_len : 16;
	}

    // get fw version @flash 0x02,0x03,0x04,0x05
    mesh_get_fw_version();

	//add the user_data after the adv_pri_data
	u8 user_const_data[6]={0x05,0x02,0x19,0x00,0x69,0x69};
	memcpy(user_data,user_const_data,sizeof(user_const_data));
    user_data_len =0 ; //disable add the userdata after the adv_pridata

	light_set_tick_per_us (CLOCK_SYS_CLOCK_HZ / 1000000);

	extern u8 pair_config_valid_flag;
	pair_config_valid_flag = PAIR_VALID_FLAG;

	extern u8 pair_config_mesh_name[17];
	u8 meshName[] = {MESH_NAME};
	memset(pair_config_mesh_name, 0, sizeof(pair_config_mesh_name));
	memcpy(pair_config_mesh_name, meshName, strlen((char *)meshName) > max_mesh_name_len? max_mesh_name_len : strlen((char *)meshName));
	
	extern u8 pair_config_mesh_pwd[17];
	u8 msehPwd[] = {MESH_PWD};
	memset(pair_config_mesh_pwd, 0, sizeof(pair_config_mesh_pwd));
	memcpy(pair_config_mesh_pwd, msehPwd, strlen((char *)msehPwd) > 16? 16:strlen((char *)msehPwd)); 
	
	extern u8 pair_config_mesh_ltk[17];
	u8 msehLtk[] = {MESH_LTK};
	memset(pair_config_mesh_ltk, 0, sizeof(pair_config_mesh_ltk));
	memcpy(pair_config_mesh_ltk, msehLtk, 16); 

	u8 service_uuid[16] = TELINK_SPP_UUID_SERVICE;
	u8 data_s2c_uuid[16] = TELINK_SPP_DATA_SERVER2CLIENT;
	u8 data_c2s_uuid[16] = TELINK_SPP_DATA_CLIENT2SERVER;
	u8 data_ota_uuid[16] = TELINK_SPP_DATA_OTA;
	u8 data_pair_uuid[16] = TELINK_SPP_DATA_PAIR;
	extern void setSppUUID(u8 *p_service_uuid, u8 *p_data_s2c_uuid, u8 *p_data_c2s_uuid, u8 *p_data_ota_uuid, u8 *p_data_pair_uuid);
	setSppUUID(service_uuid, data_s2c_uuid, data_c2s_uuid, data_ota_uuid, data_pair_uuid);

	p_adv_pri_data = (u8*)(&adv_pri_data);
	adv_private_data_len = sizeof(ll_adv_private_t);
	p_adv_rsp_data = (u8*)(&adv_rsp_pri_data);

	rf_link_slave_pairing_enable (1);
	
	rf_set_power_level_index (RF_POWER_8dBm);
	
	rf_link_slave_set_buffer (buff_response[0], 48);

	//rf_link_set_debug_adv_channel (38);

	rf_link_set_max_bridge (BRIDGE_MAX_CNT);
	vendor_id_init(VENDOR_ID);

	//extern void	rf_link_set_max_relay (u8 num);
	//rf_link_set_max_relay (3);
	
	light_hw_timer0_config();
	light_hw_timer1_config();

	extern u32 online_status_timeout;
    online_status_timeout = ONLINE_STATUS_TIMEOUT;
    
#if(PA_ENABLE)
    pa_init(0, 0);
#endif

#if(MESH_PAIR_ENABLE)
	mesh_pair_init();
#endif
}

void light_set_master_data(void){
	// write_master_data means need to send some data to master,just padding data into send_to_master[]
	if(write_master_data){
		write_master_data = 0;
		memcpy(send_to_master, (u8*)&slave_send_data, 4);
	}
}

